spqr/umichmoo/gcc/msp430_gcc_support_files/msp430fw427.h
/* SIFTSM */
#define SIFCH0              (0x0001)    /* SIF Select channel for tsm: 0 */
#define SIFCH1              (0x0002)    /* SIF Select channel for tsm: 1 */
#define SIFLCEN             (0x0004)    /* SIF LC enable */
#define SIFEX               (0x0008)    /* SIF  */
#define SIFCA               (0x0010)    /* SIF  */
#define SIFCLKON            (0x0020)    /* SIF  */
#define SIFRSON             (0x0040)    /* SIF  */
#define SIFTESTS1           (0x0080)    /* SIF  */
#define SIFDAC              (0x0100)    /* SIF  */
#define SIFSTOP             (0x0200)    /* SIF  */
#define SIFACLK             (0x0400)    /* SIF  */
#define SIFREPEAT0          (0x0800)    /* SIF  */
#define SIFREPEAT1          (0x1000)    /* SIF  */
#define SIFREPEAT2          (0x2000)    /* SIF  */
#define SIFREPEAT3          (0x4000)    /* SIF  */
#define SIFREPEAT4          (0x8000)    /* SIF  */

/************************************************************
* Interrupt Vectors (offset from 0xFFE0)
************************************************************/

#define BASICTIMER_VECTOR       ( 1)                     /* 0xFFE0 Basic Timer */
#define PORT2_VECTOR            ( 2)                     /* 0xFFE2 Port 2 */
#define PORT1_VECTOR            ( 5)                     /* 0xFFE8 Port 1 */
#define TIMER0_A1_VECTOR        ( 6)                     /* 0xFFEA Timer0_A CC1-2, TA0 */
#define TIMER0_A0_VECTOR        ( 7)                     /* 0xFFEC Timer0_A CC0 */
#define SCANIF_VECTOR           (10)                     /* 0xFFF2 Scan Inteface */
#define WDT_VECTOR              (11)                     /* 0xFFF4 Watchdog Timer */
#define COMPARATORA_VECTOR      (12)                     /* 0xFFF6 Comparator A */
#define TIMER1_A1_VECTOR        (13)                     /* 0xFFF8 Timer1_A CC1-4, TA1 */
#define TIMER1_A0_VECTOR        (14)                     /* 0xFFFA Timer1_A CC0 */
#define NMI_VECTOR              (15)                     /* 0xFFFC Non-maskable */
#define RESET_VECTOR            ("reset")                /* 0xFFFE Reset [Highest Priority] */

/* Alternate Names */

/************************************************************
* End of Modules
************************************************************/
#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __msp430xW42x */

